In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [20]:
df = pd.DataFrame(randn(6,2),hier_index, ['A','B'])

In [21]:
df #multi level hierchy

             A         B
G1 1 -0.506638  0.374558
   2 -0.957580  0.263287
   3  0.109145 -0.868845
G2 1  0.594982  0.360420
   2  0.891297  0.527954
   3 -1.802072 -0.540079

In [24]:
df.index.names = ['Groups','Num']

In [26]:
 df

                   A         B
Groups Num
G1     1   -0.506638  0.374558
       2   -0.957580  0.263287
       3    0.109145 -0.868845
G2     1    0.594982  0.360420
       2    0.891297  0.527954
       3   -1.802072 -0.540079

In [29]:
# G2 Col B: 
df.loc['G2'].loc[2]['B']

0.5279536130612446

In [34]:
# 0.263287
df.loc['G1'].loc[2]['B']

0.26328749684304686

### Cross Section

In [39]:
df

                   A         B
Groups Num
G1     1   -0.506638  0.374558
       2   -0.957580  0.263287
       3    0.109145 -0.868845
G2     1    0.594982  0.360420
       2    0.891297  0.527954
       3   -1.802072 -0.540079

In [38]:
#or which can grab from diff levels
df.xs('G1')

            A         B
Num
1   -0.506638  0.374558
2   -0.957580  0.263287
3    0.109145 -0.868845

In [40]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.506638  0.374558
G2      0.594982  0.360420

### Missing Data

In [41]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [42]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [43]:
df = pd.DataFrame(d)

In [44]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.dropna()
# drops any rows with null
# axis is 0
# axis = 1 to drop columns

     A    B  C
0  1.0  5.0  1

In [47]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [48]:
df.dropna(thresh=2)
# drops anything with less than two values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:

df.fillna(value='Value')

       A      B  C
0    1.0    5.0  1
1    2.0  Value  2
2  Value  Value  3

In [54]:
df['A'].fillna(value=df['A'].mean()) 
# adds the avg to the null

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby
Allows you to group a row based on column and perform aggregate function

In [56]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [57]:
df = pd.DataFrame(data)

In [58]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [59]:
#groupby company
df.groupby('Company')

In [60]:
bycomp = df.groupby('Company')

In [63]:
bycomp.mean() #avg sales ignores any strings

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [64]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [65]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [67]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [70]:
df.groupby('Company').sum().loc['FB']
# is the same thing written in less steps

Sales    593
Name: FB, dtype: int64

In [73]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [85]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Operations

In [86]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
df['col2'].unique()

array([444, 555, 666])

In [92]:
 df['col2'].nunique()

3

In [93]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [94]:
  df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [96]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [97]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [98]:
 df[(df['col1']>2) | (df['col2']== 444)]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [99]:
#apply method

def times2(x):
    return x*2

In [101]:
df['col1'].sum()

10

In [104]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [107]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [110]:
df['col2'].apply(lambda x: x*2)

#lambda saves time without creating a function

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [111]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [115]:
 df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [113]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [116]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [117]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [120]:
df.isnull()
#returns all null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [2]:
import pandas as pd

In [3]:
 pwd

'/Users/luisballesteros/Desktop/AnalyticsPython/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas'

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df.to_csv('newexample')

In [7]:
pd.read_csv('newexample')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
df.to_csv('newexample', index = False)

In [9]:
pd.read_csv('newexample')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
pd.read_excel('Excel_Sample.xlsx',sheet_name = 'Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_excel('excelexample.xlsx', sheet_name = 'newsheet')
#convert dataframe to an excel file

In [17]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [18]:
type(data)

list

In [19]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645